#ifndef _TIMER_H
#define _TIMER_H
#include "sys.h"


/******Timer_1*****************************************************************/
void TIM1_Init(void);


/******Timer_2*****************************************************************/
//#define TIMER_2_INTERRUPT_FUNCTION_ENABLE    //使能本文件内的Timer_2中断函数

// 通用定时器Tiemr2初始化 无中断
void Timer2_Timekeeping_Init(u16 arr, u16 psc);


/******Timer_3*****************************************************************/
//#define TIMER_3_INTERRUPT_FUNCTION_ENABLE    //使能本文件内的Timer_3中断函数

// 通用定时器Tiemr3初始化 带中断
void Timer3_Interrupt_Init(u16 arr, u16 psc);




/******Timer_4*****************************************************************/

/**********************************************
* TIM4 Encoder模式初始化
* 编码器接口模式
**********************************************/
void TIM4_Encoder_Init(void);

/**************************************************************************
函数功能：单位时间读取编码器计数
入口参数：定时器
返回  值：速度值
**************************************************************************/
int Get_TIM4_Encoder(void);



/******Timer_5*****************************************************************/

/**********************************************
* TIM5PWM初始化
* TIM5_PWM_Init(500-1,84-1);
* 84M/84=1Mhz的计数频率,重装载值500
* 所以PWM频率为 1M/500=2Khz.
**********************************************/
void TIM5_PWM_Init(u32 arr, u32 psc);
/**********************************************
* 设置TIM5_CH1的PWM值
**********************************************/
void Set_PWM_TIM5_CH1(uint32_t pwm);
/**********************************************
* 设置TIM5_CH2的PWM值
**********************************************/
void Set_PWM_TIM5_CH2(uint32_t pwm);



/******Timer_6*****************************************************************/
#define TIMER_6_INTERRUPT_FUNCTION_ENABLE    //使能本文件内的Timer_6中断函数

// 通用定时器Tiemr6初始化 带中断
void Timer6_Interrupt_Init(u16 arr, u16 psc);

// 开启Timer6定时器
void Timer6_ON(void);

// 关闭Timer6定时器
void Timer6_OFF(void);


/******Timer_10*****************************************************************/
void TIM10_CH1_PWM_Init(uint16_t arr, u16 psc);


/******Timer_11*****************************************************************/
void TIM11_CH1_PWM_Init(uint16_t arr, u16 psc);

#endif
