#include <stdint.h>


/**********************************************
* 微秒延时 us
**********************************************/
void delay_us(volatile uint32_t nTime);


/**********************************************
* 毫秒延时 ms
**********************************************/
void delay_ms(volatile uint32_t nTime);


/**********************************************
* 获取系统时间 单位us
* 两次获取若大于u32/1000(us),则两次差值溢出，不可取
**********************************************/
__INLINE uint32_t GetSysTime_us(void);
