//-----------------------------------------------------------------------------
// My_Flag.h
//
//  Created on	: 2016-10-7
//      Author	: DGVY
//		version	: V2.0
//		brief	: 状态标志位
//-----------------------------------------------------------------------------
// Attention:
//      所有的状态标识变量都用此文件定义

//-----------------------------------------------------------------------------
// Define to prevent recursive inclusion
//-----------------------------------------------------------------------------
#ifndef __MY_FLAG_H
#define __MY_FLAG_H
	

//-----------------------------------------------------------------------------
// 二元状态标志
//-----------------------------------------------------------------------------
typedef enum
{
    MY_TRUE = 1,
    MY_FALSE = 0
}eBoolTypedef;

#define Flag eBoolTypedef

// 重定义
#define Ready       MY_TRUE   
#define Not_Ready   MY_FALSE


//标志位改变
#define FLAG_CHANGE(x) ((x == MY_TRUE)? (x = MY_FALSE) : (x = MY_TRUE))

//-----------------------------------------------------------------------------
// 多元状态标志
//-----------------------------------------------------------------------------
typedef enum
{
    Block_1,
    Block_2,
    Block_3,
    Block_4,
    //可自行添加
}MultiState;


typedef enum
{
    Block_init,
    Block_temp1,
    Block_temp2,
    Block_temp3
}temp_block;

// 重定义



//-----------------------------------------------------------------------------
// Extern
//-----------------------------------------------------------------------------


#endif /* __MY_FLAG_H */
/******************* (C) COPYRIGHT 2016 DGVY **********END OF FILE***********/
